app/controllers/api/memos_controller.rb

  def create
    memo = Memo.new(create_params)
    unless memo.save
---
INSERT INTO `memos` (`text`, `created_at`, `updated_at`) VALUES ('Lorem ipsum dolor sit er elit lamet, consectetaur cillium adipisicing pecu, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum. Nam liber te conscient to factor tum poen legum odioque civiuda.', '2016-03-03 13:26:42', '2016-03-03 13:26:42')

  def map
    @points = Memo.all.limit('1').order('created_at DESC')
    @hash = Gmaps4rails.build_markers(@points) do |memo, marker|
      marker.lat memo.lat
      marker.lng memo.long
    end
    y = Memo.order('created_at DESC').pluck(:lat)[0]
    x = Memo.order('created_at DESC').pluck(:long)[0]
---
SELECT  `memos`.* FROM `memos`  ORDER BY created_at DESC LIMIT 5
SELECT `memos`.`lat` FROM `memos`  ORDER BY created_at DESC
SELECT `memos`.`long` FROM `memos`  ORDER BY created_at DESC