app/controllers/api/memos_controller.rb

SELECT `memos`.* FROM `memos`
---
  def index
    @points = Memo.all